10/data/attachments/4fc5c65ae83090b6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Logan_gas_Friend_95803_2</nif:username>
            <nif:friendToBeRequested>soap_friends_d535f6f4-5973-4e41-a281-afdc7dc84fea</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>